Performance/Results/2026-09-17-isolation/2-vapor4-tiny-measured.txt
Running 5s test @ http://127.0.0.1:18080/bench/tiny
  4 threads and 64 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     0.87ms  309.16us   6.33ms   82.84%
    Req/Sec    18.41k     1.27k   20.49k    78.43%
  Latency Distribution
     50%  805.00us
     75%    0.91ms
     90%    1.27ms
     99%    1.91ms
  373604 requests in 5.10s, 50.59MB read
Requests/sec:  73254.32
Transfer/sec:      9.92MB

METRICS {"requests":373604,"duration_us":5100095,"bytes":53051768,"p50_us":805,"p99_us":1912,"connect_errors":0,"read_errors":0,"write_errors":0,"status_errors":0,"timeouts":0}