Performance/Results/2026-09-17-isolation/3-vapor-direct-tiny-measured.txt
Running 5s test @ http://127.0.0.1:18080/bench/tiny
  4 threads and 64 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.03ms  276.30us   8.88ms   87.52%
    Req/Sec    15.44k     1.03k   16.77k    76.47%
  Latency Distribution
     50%    0.99ms
     75%    1.09ms
     90%    1.23ms
     99%    2.10ms
  313338 requests in 5.10s, 24.20MB read
Requests/sec:  61437.47
Transfer/sec:      4.75MB

METRICS {"requests":313338,"duration_us":5100112,"bytes":25380457,"p50_us":990,"p99_us":2095,"connect_errors":0,"read_errors":0,"write_errors":0,"status_errors":0,"timeouts":0}